/*   "Намалюйте" в консолі прямокутний трикутник із зірочок 
(або плюсиків, або якогось іншого символу): на першому рядку - одна зірочка,
 на другому дві, і так далі. Рішення оформіть у вигляді функції, куди 
 передаються два параметри: висота трикутника та символ, яким його 
 потрібно "малювати". Наприклад:

drawTriangle(5,*); 
* 
** 
*** 
**** 
******
*/
// Кількість строк це u, k не змінювати))
var u = 4
var j = ''
var k = 1

while (u) {
    for (u>0; u>=k; k++) 
    console.log(j += '*')
    break
}

