
/* ЗАВДАННЯ-1. Дано змінні a і b. 
Перевірте, що "a" ділиться без залишку на "b". 
Якщо це так - виведіть 'Ділиться' і результат поділу, 
інакше виведіть 'Ділиться з залишком' та залишок від поділу. */
console.log("ЗАВДАННЯ-1")
var a = 3
var b = 2
var c = a % b

if (c % 2 === 0) {
    console.log('Ділиться (результат діленя = ' + a / b + ')')
}
else {
    console.log('Ділиться з залишком (залишок = ' + c + ')')
}

console.log('-----------------------------------------------------')


/* ЗАВДАННЯ-2. "Намалюйте" в консолі прямокутний трикутник 
із зірочок (або плюсиків, або якогось іншого символу): 
на першому рядку - одна зірочка, на другому дві, і так далі.
Рішення оформіть у вигляді функції, куди передаються два 
параметри: висота трикутника та символ, яким його потрібно 
"малювати". Наприклад:
drawTriangle(5,*); 
* 
** 
*** 
**** 
****** 
---
*/
console.log("ЗАВДАННЯ-2")

var x = 5
var y = '*'

console.log(x)
var x = triangleFun(x,y)

function triangleFun(a, b) {
    var star = '';
    for (var i = 0; i < a; i++) {
        star = star + b
        console.log(star)
    }
}




/* Завдання - 3 рішення без функції */
/*
console.log("ЗАВДАННЯ-2")
var star = '';
for (var i = 0; i < 5; i++) {
    star = star + '*';
    console.log(star);
}
console.log('-----------------------------------------------------')
*/



/* ЗАВДАННЯ-3. Виведіть в консоль 
непарні числа у проміжку від 0 до 100.*/

console.log("ЗАВДАННЯ-3")

var str = '';
var range = '100'
for (var i = 1; i <= range; i++) {
    if (i % 2 === 0) {
        continue
    }
    if (i < (range - 1)) {
        str = str + (i + ', ')
    }
    else {
        str = str + (i + '.')
    }
}
console.log('Непарні числа у проміжку від 0 до 100: ' + str)
console.log('-----------------------------------------------------')


/* ЗАВДАННЯ-4. Дано число n = 1000. Поділіть його на 2 стільки разів, поки результат поділу не буде меньше 50. Яке число вийде? Порахуйте кількість ітерацій, необхідних для цього. */

console.log("ЗАВДАННЯ-4")

console.log(resFun(1000))

function resFun(a) {
    var iteration = 0;
    for (var i = 1; i < a; i++) {

        if (a > 50) {
            a = a / 2
            iteration = ++iteration
        }

        else {
            continue
        }
        /* console.log (iteration, a) - результат кожної ітерації */
    }
    return ('Кількість ітерацій: ' + iteration + ' Результат поділу: ' + a)
}

console.log('-----------------------------------------------------')
