/* ЗАВДАННЯ-1. Дано змінні a і b. 
Перевірте, що "a" ділиться без залишку на "b". 
Якщо це так - виведіть 'Ділиться' і результат поділу, 
інакше виведіть 'Ділиться з залишком' та залишок від поділу. */

console.log("ЗАВДАННЯ-1")
var a = 5
var b = 3
var c = a % b
console.log(c.toFixed(2))

console.log('ви ввели ділене (А = ' + a + ') дільник (В = ' + b + ') результат: ')

if (c === 0) {
    console.log('Ділиться (результат діленя = ' + a / b + ')')
}
else {
    console.log('Ділиться з залишком (залишок = ' + c.toFixed(2) + ')')
} 

